UniSwarm/uDevkit-SDK/support/driver/adc/adc_dspic33_sar12.c
/**
 * @file adc_dspic33_sar12.c
 * @author Sebastien CAUX (sebcaux)
 * @copyright UniSwarm 2018-2023
 *
 * @date December 13, 2018, 09:26 AM
 *
 * @brief ADC driver support for dsPIC33E GS, dsPIC33CK and dsPIC33CH
 *
 * Implementation based on Microchip document DS70005213F :
 *  http://ww1.microchip.com/downloads/en/DeviceDoc/70005213f.pdf
 */

#include "adc.h"

#include <archi.h>

#include <stdlib.h>

void adc_calib(void);

#ifdef UDEVKIT_HAVE_CONFIG
#    include "udevkit_config.h"
#endif

#ifndef ADC_NOHANDLER
#    ifdef ADC_CHANNEL_HAVE_CH0
void __attribute__((interrupt, auto_psv, weak)) _ADCAN0Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH1
void __attribute__((interrupt, auto_psv, weak)) _ADCAN1Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH2
void __attribute__((interrupt, auto_psv, weak)) _ADCAN2Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH3
void __attribute__((interrupt, auto_psv, weak)) _ADCAN3Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH4
void __attribute__((interrupt, auto_psv, weak)) _ADCAN4Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH5
void __attribute__((interrupt, auto_psv, weak)) _ADCAN5Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH6
void __attribute__((interrupt, auto_psv, weak)) _ADCAN6Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH7
void __attribute__((interrupt, auto_psv, weak)) _ADCAN7Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH8
void __attribute__((interrupt, auto_psv, weak)) _ADCAN8Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH9
void __attribute__((interrupt, auto_psv, weak)) _ADCAN9Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH10
void __attribute__((interrupt, auto_psv, weak)) _ADCAN10Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH11
void __attribute__((interrupt, auto_psv, weak)) _ADCAN11Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH12
void __attribute__((interrupt, auto_psv, weak)) _ADCAN12Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH13
void __attribute__((interrupt, auto_psv, weak)) _ADCAN13Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH14
void __attribute__((interrupt, auto_psv, weak)) _ADCAN14Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH15
void __attribute__((interrupt, auto_psv, weak)) _ADCAN15Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH16
void __attribute__((interrupt, auto_psv, weak)) _ADCAN16Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH17
void __attribute__((interrupt, auto_psv, weak)) _ADCAN17Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH18
void __attribute__((interrupt, auto_psv, weak)) _ADCAN18Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH19
void __attribute__((interrupt, auto_psv, weak)) _ADCAN19Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH20
void __attribute__((interrupt, auto_psv, weak)) _ADCAN20Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH21
void __attribute__((interrupt, auto_psv, weak)) _ADCAN21Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH22
void __attribute__((interrupt, auto_psv, weak)) _ADCAN22Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH23
void __attribute__((interrupt, auto_psv, weak)) _ADCAN23Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH24
void __attribute__((interrupt, auto_psv, weak)) _ADCAN24Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH25
void __attribute__((interrupt, auto_psv, weak)) _ADCAN25Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH26
void __attribute__((interrupt, auto_psv, weak)) _ADCAN26Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH27
void __attribute__((interrupt, auto_psv, weak)) _ADCAN27Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH28
void __attribute__((interrupt, auto_psv, weak)) _ADCAN28Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH29
void __attribute__((interrupt, auto_psv, weak)) _ADCAN29Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH30
void __attribute__((interrupt, auto_psv, weak)) _ADCAN30Interrupt(void);
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH31
void __attribute__((interrupt, auto_psv, weak)) _ADCAN31Interrupt(void);
#    endif
#endif  // !ADC_NOHANDLER

struct adc_params
{
    uint8_t masterClock_src;
    uint8_t masterClock_div;
};

struct adc_params _adc_params = {
    .masterClock_src = 0b00,   // default : clock from FP (FOSC /2)
    .masterClock_div = 1 - 1,  // default : 1:1 clock divider
};

struct adc_dev
{
#ifndef ADC_NOHANDLER
    void (*handler)(int16_t);
#endif  // !ADC_NOHANDLER
};

#ifndef ADC_NOHANDLER
static struct adc_dev _adcs[] = {
#    if ADC_CHANNEL_MAX >= 0
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 1
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 2
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 3
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 4
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 5
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 6
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 7
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 8
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 9
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 10
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 11
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 12
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 13
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 14
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 15
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 16
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 17
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 18
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 19
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 20
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 21
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 22
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 23
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 24
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 25
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 26
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 27
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 28
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 29
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
#    if ADC_CHANNEL_MAX >= 30
    {
#        ifndef ADC_NOHANDLER
        .handler = NULL,
#        endif  // !ADC_NOHANDLER
    },
#    endif
};
#endif  // !ADC_NOHANDLER

void adc_calib(void)
{
    ADCON5Hbits.WARMTIME = 15;  // Set initialization time to maximum

    ADCON1Lbits.ADON = 1;  // Turn on ADC module

