UniSwarm/uDevkit-SDK/support/driver/adc/adc_dspic33_sar12.c
    return 0;
}

int adc_setMasterClock(uint8_t source, uint16_t divider)
{
    // Configure the common ADC clock.
    _adc_params.masterClock_src = source;
    ADCON3Hbits.CLKSEL = source;

    if (divider < 1)
    {
        divider = 1;
    }

    _adc_params.masterClock_div = divider - 1;
    ADCON3Hbits.CLKDIV = divider - 1;

    return 0;
}

int adc_setCoreClockDivider(uint8_t core, uint16_t divider)
{
    if (divider < 1)
    {
        divider = 1;
    }

    switch (core)
    {
#ifdef ADC_HAVE_DEDICATED_CORE0
        case 0:
            ADCORE0Hbits.ADCS = divider - 1;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE1
        case 1:
            ADCORE1Hbits.ADCS = divider - 1;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE2
        case 2:
            ADCORE2Hbits.ADCS = divider - 1;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE3
        case 3:
            ADCORE3Hbits.ADCS = divider - 1;
            break;
#endif
        default:  // shared core
            ADCON2Lbits.SHRADCS = divider - 1;
            break;
    }

    return 0;
}

int adc_setCoreResolution(uint8_t core, uint16_t resolution)
{
    switch (core)
    {
#ifdef ADC_HAVE_DEDICATED_CORE0
        case 0:
            ADCORE0Hbits.RES = resolution;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE1
        case 1:
            ADCORE1Hbits.RES = resolution;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE2
        case 2:
            ADCORE2Hbits.RES = resolution;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE3
        case 3:
            ADCORE3Hbits.RES = resolution;
            break;
#endif
        default:  // shared core
            ADCON1Hbits.SHRRES = resolution;
            break;
    }

    return 0;
}

int adc_setSamplingCycles(uint8_t core, uint16_t cycles)
{
#ifdef ADC_HAVE_DEDICATED_CORE0
    uint8_t enable = (cycles > 0);
#endif

    if (cycles < 2)
    {
        cycles = 2;
    }

    if (cycles > 1024 + 2)
    {
        cycles = 1024 + 2;
    }

    switch (core)
    {
#ifdef ADC_HAVE_DEDICATED_CORE0
        case 0:
            ADCORE0Lbits.SAMC = cycles - 2;
            ADCON4Lbits.SAMC0EN = enable;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE1
        case 1:
            ADCORE1Lbits.SAMC = cycles - 2;
            ADCON4Lbits.SAMC1EN = enable;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE2
        case 2:
            ADCORE2Lbits.SAMC = cycles - 2;
            ADCON4Lbits.SAMC2EN = enable;
            break;
#endif
#ifdef ADC_HAVE_DEDICATED_CORE3
        case 3:
            ADCORE3Lbits.SAMC = cycles - 2;
            ADCON4Lbits.SAMC3EN = enable;
            break;
#endif
        default:  // shared core
            ADCON2Hbits.SHRSAMC = cycles - 2;
            break;
    }

    return 0;
}

int adc_softTrig(void)
{
    int trig = ADCON3Lbits.SWCTRG;
    ADCON3Lbits.SWCTRG = 1;  // trig all ADC channel with ADC_TRIGSRCxx = ADC_TRGSRC_COMMONSOFTTRG
    return trig;
}

int adc_startSampling(uint8_t channel)
{
    if (channel > ADC_CHANNEL_MAX)
    {
        return -1;
    }

    while (ADCON3Lbits.CNVRTCH != 0)
    {
        ;
    }

    ADCON3Lbits.CNVCHSEL = channel;  // select channel to convert
    ADCON3Lbits.CNVRTCH = 1;         // Start sampling

    return 0;
}

int adc_dataReady(uint8_t channel)
{
    int ready;
    uint16_t bitMask;

    if (channel > ADC_CHANNEL_MAX)
    {
        return -1;
    }

    if (channel < 16)
    {
        bitMask = (0x0001 << channel);
        ready = (ADSTATL & bitMask) != 0;
    }
    else
    {
        bitMask = (0x0001 << (channel - 16));
        ready = (ADSTATH & bitMask) != 0;
    }
    return ready;
}

int16_t adc_value(uint8_t channel)
{
    if (channel > ADC_CHANNEL_MAX)
    {
        return -1;
    }
    return *(&ADCBUF0 + channel);  // Read the ADC conversion result
}

volatile int16_t *adc_buffAddr(uint8_t channel)
{
    if (channel > ADC_CHANNEL_MAX)
    {
        return NULL;
    }
    return (volatile int16_t *)(&ADCBUF0 + channel);
}

int16_t adc_getValue(uint8_t channel)
{
    uint16_t bitMask;
    if (channel > ADC_CHANNEL_MAX)
    {
        return -1;
    }

    while (ADCON3Lbits.CNVRTCH == 1)
    {
        ;
    }

    ADCON3Lbits.CNVCHSEL = channel;  // select channel to convert
    ADCON3Lbits.CNVRTCH = 1;         // Start sampling

    if (channel < 16)
    {
        bitMask = (0x0001 << channel);
        while ((ADSTATL & bitMask) == 0)
        {
            ;
        }
    }
    else
    {
        bitMask = (0x0001 << (channel - 16));
        while ((ADSTATH & bitMask) == 0)
        {
            ;
        }
    }

    return *(&ADCBUF0 + channel);  // Read the ADC conversion result
}

int adc_setTriggerSource(uint8_t channel, uint8_t triggerSource)
{
    if (channel > ADC_CHANNEL_MAX)
    {
        return -1;
    }

    volatile char *adc_triggerReg = ((volatile char *)&ADTRIG0L) + channel;
    *adc_triggerReg = triggerSource;

    return 0;
}

int adc_setHandler(uint8_t channel, void (*handler)(int16_t))
{
#ifndef ADC_NOHANDLER
    if (channel > ADC_CHANNEL_MAX)
    {
        return -1;
    }

    switch (channel)
    {
#    ifdef ADC_CHANNEL_HAVE_CH0
        case 0:
            _ADCAN0IF = 0;
            _ADCAN0IE = (handler != 0);
            _IE0 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH1
        case 1:
            _ADCAN1IF = 0;
            _ADCAN1IE = (handler != 0);
            _IE1 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH2
        case 2:
            _ADCAN2IF = 0;
            _ADCAN2IE = (handler != 0);
            _IE2 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH3
        case 3:
            _ADCAN3IF = 0;
            _ADCAN3IE = (handler != 0);
            _IE3 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH4
        case 4:
            _ADCAN4IF = 0;
            _ADCAN4IE = (handler != 0);
            _IE4 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH5
        case 5:
            _ADCAN5IF = 0;
            _ADCAN5IE = (handler != 0);
            _IE5 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH6
        case 6:
            _ADCAN6IF = 0;
            _ADCAN6IE = (handler != 0);
            _IE6 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH7
        case 7:
            _ADCAN7IF = 0;
            _ADCAN7IE = (handler != 0);
            _IE7 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH8
        case 8:
            _ADCAN8IF = 0;
            _ADCAN8IE = (handler != 0);
            _IE8 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH9
        case 9:
            _ADCAN9IF = 0;
            _ADCAN9IE = (handler != 0);
            _IE9 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH10
        case 10:
            _ADCAN10IF = 0;
            _ADCAN10IE = (handler != 0);
            _IE10 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH11
        case 11:
            _ADCAN11IF = 0;
            _ADCAN11IE = (handler != 0);
            _IE11 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH12
        case 12:
            _ADCAN12IF = 0;
            _ADCAN12IE = (handler != 0);
            _IE12 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH13
        case 13:
            _ADCAN13IF = 0;
            _ADCAN13IE = (handler != 0);
            _IE13 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH14
        case 14:
            _ADCAN14IF = 0;
            _ADCAN14IE = (handler != 0);
            _IE14 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH15
        case 15:
            _ADCAN15IF = 0;
            _ADCAN15IE = (handler != 0);
            _IE15 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH16
        case 16:
            _ADCAN16IF = 0;
            _ADCAN16IE = (handler != 0);
            _IE16 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH17
        case 17:
            _ADCAN17IF = 0;
            _ADCAN17IE = (handler != 0);
            _IE17 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH18
        case 18:
            _ADCAN18IF = 0;
            _ADCAN18IE = (handler != 0);
            _IE18 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH19
        case 19:
            _ADCAN19IF = 0;
            _ADCAN19IE = (handler != 0);
            _IE19 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH20
        case 20:
            _ADCAN20IF = 0;
            _ADCAN20IE = (handler != 0);
            _IE20 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH21
        case 21:
            _ADCAN21IF = 0;
            _ADCAN21IE = (handler != 0);
            _IE21 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH22
        case 22:
            _ADCAN22IF = 0;
            _ADCAN22IE = (handler != 0);
            _IE22 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH23
        case 23:
            _ADCAN23IF = 0;
            _ADCAN23IE = (handler != 0);
            _IE23 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH24
        case 24:
            _ADCAN24IF = 0;
            _ADCAN24IE = (handler != 0);
            _IE24 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH25
        case 25:
            _ADCAN25IF = 0;
            _ADCAN25IE = (handler != 0);
            _IE25 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH26
        case 26:
            _ADCAN26IF = 0;
            _ADCAN26IE = (handler != 0);
            _IE26 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH27
        case 27:
            _ADCAN27IF = 0;
            _ADCAN27IE = (handler != 0);
            _IE27 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH28
        case 28:
            _ADCAN28IF = 0;
            _ADCAN28IE = (handler != 0);
            _IE28 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH29
        case 29:
            _ADCAN29IF = 0;
            _ADCAN29IE = (handler != 0);
            _IE29 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH30
        case 30:
            _ADCAN30IF = 0;
            _ADCAN30IE = (handler != 0);
            _IE30 = 1;
            break;
#    endif
#    ifdef ADC_CHANNEL_HAVE_CH31
        case 31:
            _ADCAN31IF = 0;
            _ADCAN31IE = (handler != 0);
            _IE31 = 1;
            break;
#    endif
    }
    _adcs[channel].handler = handler;
    return 0;
#else
    UDK_UNUSED(channel);
    UDK_UNUSED(handler);
    return -1;
#endif  // !ADC_NOHANDLER
}

#if defined(ADC_CHANNEL_HAVE_CH0) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN0Interrupt(void)
{
    (*_adcs[0].handler)(ADCBUF0);
    _ADCAN0IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH1) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN1Interrupt(void)
{
    (*_adcs[1].handler)(ADCBUF1);
    _ADCAN1IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH2) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN2Interrupt(void)
{
    (*_adcs[2].handler)(ADCBUF2);
    _ADCAN2IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH3) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN3Interrupt(void)
{
    (*_adcs[3].handler)(ADCBUF3);
    _ADCAN3IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH4) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN4Interrupt(void)
{
    (*_adcs[4].handler)(ADCBUF4);
    _ADCAN4IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH5) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN5Interrupt(void)
{
    (*_adcs[5].handler)(ADCBUF5);
    _ADCAN5IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH6) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN6Interrupt(void)
{
    (*_adcs[6].handler)(ADCBUF6);
    _ADCAN6IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH7) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN7Interrupt(void)
{
    (*_adcs[7].handler)(ADCBUF7);
    _ADCAN7IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH8) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN8Interrupt(void)
{
    (*_adcs[8].handler)(ADCBUF8);
    _ADCAN8IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH9) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN9Interrupt(void)
{
    (*_adcs[9].handler)(ADCBUF9);
    _ADCAN9IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH10) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN10Interrupt(void)
{
    (*_adcs[10].handler)(ADCBUF10);
    _ADCAN10IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH11) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN11Interrupt(void)
{
    (*_adcs[11].handler)(ADCBUF11);
    _ADCAN11IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH12) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN12Interrupt(void)
{
    (*_adcs[12].handler)(ADCBUF12);
    _ADCAN12IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH13) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN13Interrupt(void)
{
    (*_adcs[13].handler)(ADCBUF13);
    _ADCAN13IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH14) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN14Interrupt(void)
{
    (*_adcs[14].handler)(ADCBUF14);
    _ADCAN14IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH15) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN15Interrupt(void)
{
    (*_adcs[15].handler)(ADCBUF15);
    _ADCAN15IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH16) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN16Interrupt(void)
{
    (*_adcs[16].handler)(ADCBUF16);
    _ADCAN16IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH17) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN17Interrupt(void)
{
    (*_adcs[17].handler)(ADCBUF17);
    _ADCAN17IF = 0;
}
#endif

