UniSwarm/uDevkit-SDK/support/driver/adc/adc_dspic33_sar12.c
#if defined(ADC_CHANNEL_HAVE_CH18) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN18Interrupt(void)
{
    (*_adcs[18].handler)(ADCBUF18);
    _ADCAN18IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH19) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN19Interrupt(void)
{
    (*_adcs[19].handler)(ADCBUF19);
    _ADCAN19IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH20) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN20Interrupt(void)
{
    (*_adcs[20].handler)(ADCBUF20);
    _ADCAN20IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH21) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN21Interrupt(void)
{
    (*_adcs[21].handler)(ADCBUF21);
    _ADCAN21IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH22) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN22Interrupt(void)
{
    (*_adcs[22].handler)(ADCBUF22);
    _ADCAN22IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH23) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN23Interrupt(void)
{
    (*_adcs[23].handler)(ADCBUF23);
    _ADCAN23IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH24) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN24Interrupt(void)
{
    (*_adcs[24].handler)(ADCBUF24);
    _ADCAN24IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH25) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN25Interrupt(void)
{
    (*_adcs[25].handler)(ADCBUF25);
    _ADCAN25IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH26) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN26Interrupt(void)
{
    (*_adcs[26].handler)(ADCBUF26);
    _ADCAN26IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH27) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN27Interrupt(void)
{
    (*_adcs[27].handler)(ADCBUF27);
    _ADCAN27IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH28) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN28Interrupt(void)
{
    (*_adcs[28].handler)(ADCBUF28);
    _ADCAN28IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH29) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN29Interrupt(void)
{
    (*_adcs[29].handler)(ADCBUF29);
    _ADCAN29IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH30) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN30Interrupt(void)
{
    (*_adcs[30].handler)(ADCBUF30);
    _ADCAN30IF = 0;
}
#endif

#if defined(ADC_CHANNEL_HAVE_CH31) && !defined(ADC_NOHANDLER)
void __attribute__((interrupt, auto_psv, weak)) _ADCAN31Interrupt(void)
{
    (*_adcs[31].handler)(ADCBUF31);
    _ADCAN31IF = 0;
}
#endif
